tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "libssh2"
brew "bat"
brew "openssl@1.1"
brew "ruby"
brew "cocoapods"
brew "fzf"
brew "gcc"
brew "go"
brew "lazygit"
brew "libevent"
brew "make"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "pyright"
brew "python@3.11"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "typescript-language-server"
brew "unzip"
cask "alacritty"
cask "font-hack-nerd-font"
vscode "dbaeumer.vscode-eslint"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "kamikillerto.vscode-colorize"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "sdras.vue-vscode-snippets"
vscode "sirtori.indenticator"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
