tap "homebrew/bundle"
tap "jesseduffield/lazygit"
brew "go"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "tmux"
brew "yazi"
brew "jesseduffield/lazygit/lazygit"
cask "alacritty"
vscode "batisteo.vscode-django"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "kamikillerto.vscode-colorize"
vscode "lewxdev.vscode-glyph"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "nichabosh.minimalist-dark"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "ritwickdey.liveserver"
vscode "sdras.vue-vscode-snippets"
vscode "sirtori.indenticator"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
