aaron-bond.better-comments
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
gluestack.gluestack-vscode
golang.go
gruntfuggly.todo-tree
kamikillerto.vscode-colorize
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
nichabosh.minimalist-dark
pkief.material-icon-theme
pkief.material-product-icons
ritwickdey.liveserver
ryuta46.multi-command
samplavigne.p5-vscode
sdras.vue-vscode-snippets
sirtori.indenticator
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vitest.explorer
vivaxy.vscode-conventional-commits
vscodevim.vim
vue.volar
wix.vscode-import-cost
